Cylinder_blockMesh/system/continuityError
continuityError1
{
    // Mandatory entries (unmodifiable)
    type            continuityError;
    libs            (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    phi             phi;

    // Optional (inherited) entries
    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    //timeEnd         1000; //inf
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;//timeStep;
    writeInterval   1;
}