Cylinder_blockMesh/system/surfaceFieldValue
inlet
{
    // Mandatory entries (unmodifiable)
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields          (U phi);//(<field1> <field2> ... <fieldN>);
    operation       sum;//<operationType>;
    regionType      patch;
    name            inlet;//<patch>;

    // Optional entries (runtime modifiable)
    postOperation   none;
    weightField     alpha1;
    scaleFactor     1.0;
    writeArea       false;
    surfaceFormat   none;

    // Optional (inherited) entries
    writeFields     false;
    scalingFactor   1.0;
    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    //timeEnd         1000; //inf
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;//timeStep;
    writeInterval   1;
}

//以下のようにすると設定を使いまわしできる
outlet//任意の名前
{
  $inlet;
  name outlet; //patch名
}